
<script setup lang="ts">
const privacyModal = ref(false);
const termsModal = ref(false);
const PrivacyAndTerms = {
    privacy: {
        title: "คำชี้แจงสิทธิ์ส่วนบุคคล",
        content: "test เนื้อหา คำชี้แจงสิทธิ์ส่วนบุคคล",
    },
    terms: {
        title: "เงื่อนไขและข้อกำหนดการรับประกัน",
        content: `หลักเกณฑ์การรับประกัน ร้านหญ้าเทียมโกรวกลาส(growgrass)
    ขอขอบพระคุณเป็นอย่างยิ่งที่ท่านได้เลือกสินค้าของทางGrowgrassและขอเรียนให้ ทราบถึงหลักเกณฑ์การรับประกันดังนี้
`,
    },
};

</script>

<template>
    <!-- //NOTE - ส่วน Link -->
    <UFormGroup>
        <UCheckbox v-model="checkbox">
            <template v-slot:label>
                <span>เมื่อคุณคลิกลงทะเบียนคุณได้ยอมรับ</span>
                <a @click="privacyModal = true" class="text-green-600 p-0 m-0 cursor-pointer hover:underline"
                    variant="link">
                    {{ PrivacyAndTerms.privacy.title }}
                </a>
                <span>&nbsp;และ&nbsp;</span>
                <a @click="termsModal = true" class="text-green-600 p-0 m-0 cursor-pointer hover:underline" variant="link">
                    {{ PrivacyAndTerms.terms.title }}
                </a>
                <span>ของ growgrass เรียบร้อยแล้ว</span>
            </template>
        </UCheckbox>
    </UFormGroup>

    <!-- //NOTE - ส่วน Modal -->
    <!-- คำชี้แจงสิทธิ์ส่วนบุคคล -->
    <UModal v-model="privacyModal" prevent-close>
        <UCard style="height: 95dvh" class="overflow-y-scroll" :ui="{
            ring: '',
            divide: 'divide-y divide-gray-100 dark:divide-gray-800',
        }">
            <template #header>
                <div class="flex items-center justify-between">
                    <h3 class="text-base font-LineBD leading-6 text-gray-900 dark:text-white">
                        {{ PrivacyAndTerms.privacy.title }}
                    </h3>
                    <UButton color="gray" variant="ghost" icon="i-heroicons-x-mark-20-solid" class="-my-1"
                        @click="privacyModal = false" />
                </div>
            </template>
            <!-- modal content -->
            <div class="dark:text-gray-200">
                <p class="font-LineBD text-2xl">นโยบายความเป็นส่วนตัว</p>
                <p class="">
                    เราเข้าใจถึงความสำคัญของสิทธิส่วนบุคคลเป็นอย่างมาก
                    เราขอยืนยันการเก็บรักษาข้อมูลส่วนตัวของท่านไว้เป็นความลับอย่างดีที่สุด
                </p>
                <br>
                <p class="">กรุณาอ่านรายละเอียด และ
                    กรุณาทำความเข้าใจเกี่ยวกับการดำเนินการที่เกี่ยวข้องพร้อมทั้งข้อมูลส่วนตัวของท่าน
                    ซึ่งนโยบายเหล่านี้อาจมีการเปลี่ยนแปลงได้โดยไม่จำเป็นต้องแจ้งให้ท่านทราบล่วงหน้า ดังนั้น
                    โปรดกรุณาติดตาม และ ตรวจสอบการเปลี่ยนแปลงอย่างสม่ำเสมอ</p>
            </div>
            <UDivider class="my-5" />
            <div>
                <UAccordion color="primary" variant="solid" size="lg" :items="[
                    {
                        label: '1. การเปิดเผยข้อมูลส่วนบุคคล',
                        slot: 'partOne',
                    },
                    {
                        label: '2. สิทธิ์การเป็นเจ้าของ',
                        slot: 'partTwo',
                    },
                    {
                        label: '3. การเก็บรักษาข้อมูล',
                        slot: 'partThree',
                    },
                    {
                        label: '4. มาตรการรักษาความปลอดภัยของข้อมูล',
                        slot: 'partFour',
                    },
                ]">
                    <template #partOne>
                        <div class="mx-3 mb-4 flex flex-col gap-3">
                            <div><span class="font-LineBD">กรุณาทำความเข้าใจเกี่ยวกับการดำเนินการที่เกี่ยวข้อง
                                </span>พร้อมทั้งข้อมูลส่วน
                                ตัวของท่าน
                                ซึ่งนโยบายเหล่านี้อาจมีการเปลี่ยนแปลงได้โดยไม่จำเป็นต้องแจ้งให้ท่านทราบ ล่วงหน้า ดังนั้น
                                โปรดกรุณาติดตามและตรวจสอบการเปลี่ยนแปลงอย่างสม่ำเสมอ</div>
                            <ol class="list-inside flex flex-col gap-4">
                                <li>
                                    <span class="font-LineBD">1.1. ข้อมูลทั่วไปของสมาชิก</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        เบอร์โทรศัพท์
                                        เมื่อท่านลงทะเบียนสมัครเป็นสมาชิกเรียบร้อยแล้ว ท่านจะมีสิทธิ์ทุกประการ
                                        ในการเป็นสมาชิก ทั้งนี้รวมถึงข้อเสนอพิเศษต่างๆ ที่สมาชิกจะได้รับจากทางร้านค้า
                                        ร้านหญ้าเทียมโกรวกลาส(Growgrass) ในกรณีที่ข้อมูลส่วนบุคคลดังกล่าว ถูก
                                        จารกรรมโดยวิธีการทางอิเล็กทรอนิกส์ (hack) หรือสูญหาย
                                        เสียหายอันเนื่องจากเหตุสุดวิสัยหรือไม่ว่ากรณีใดๆทั้งสิ้น
                                        ทางร้านหญ้าเทียมโกรวกลาส(Growgrass) ขอปฏิเสธความรับผิดจากเหตุดังกล่าวทั้งหมด</div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.2. Cookies</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        Cookies คือ ข้อมูลขนาดเล็กที่จะถูกส่งไปเก็บไว้ในบราวเซอร์ของท่าน
                                        เพื่อทำการเก็บข้อมูลการเข้าเยี่ยมชม
                                        เมื่อท่านเปิดเข้าไปเยี่ยมชมเว็บไซต์ของเราอีกครั้งในคราวหลังเครื่องก็จะจำ
                                        ได้ทันทีว่าท่านเคยเข้ามาเยี่ยมชมแล้ว
                                        Cookies ไม่ใช่โปรแกรมที่จะเข้าไปอยู่ในระบบคอมพิวเตอร์ของผู้ใช้งานแล้วทำลายไฟล์ ต่างๆ
                                        แต่มีไว้เพื่อช่วยให้เราคอยติดตามว่าผู้ใช้แวะเยี่ยมหน้าใดบ้าง
                                        เริ่มต้นจากหน้าไหนจบลงด้วยหน้าไหนและบ่อยแค่ไหน เราไม่ได้ใช้ Cookies
                                        เพื่อตรวจสอบว่าผู้ใช้คือใคร
                                        เพียงแต่บอกว่าเครื่องคอมพิวเตอร์นี้เคยเข้ามาเยี่ยมชมเว็บไซต์ของเราแล้ว
                                        Cookies ไม่ได้ใช้สำหรับเก็บข้อมูลส่วนบุคคล เช่น ชื่อ ที่อยู่อีเมล์
                                        หากท่านไม่ประสงค์ให้ Cookies เข้าไปอยู่ในคอมพิวเตอร์ของท่าน ท่านสามารถ
                                        สั่งให้บราวเซอร์ปฏิเสธไฟล์ Cookies ได้</div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.3. การใช้ข้อมูลของสมาชิก</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        จุดประสงค์หลักในการจัดเก็บข้อมูลสมาชิก คือเพื่อแจ้งข้อมูล ข่าวสาร กิจกรรม
                                        และบริการต่างๆ ที่จะมีกับร้านหญ้าเทียมโกรวกลาส(Growgrass)
                                        หากท่านไม่สนใจหรือไม่มีความประสงค์ในการรับข้อมูลข่าวสารต่างๆ
                                        ท่านสามารถแก้ไขข้อมูลต่างๆ ได้ทุกเมื่อ
                                        หรือแจ้งความจำนงค์มาได้ที่ growgrassth@gmail.com
                                    </div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.4. การเก็บข้อมูลของสมาชิก</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        ทางร้านหญ้าเทียมโกรวกลาส(Growgrass)รับประกันว่าจะเก็บข้อมูลสมาชิกอย่างดีที่สุด
                                        ยกเว้นจะเกิดเหตุตามข้อ 1
                                    </div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.5. การเปิดเผยข้อมูลต่อสาธารณชน</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วัน เดือน ปีเกิด
                                        ปกติแล้วทางร้านหญ้าเทียมโกรวกลาส(Growgrass)มิได้เปิดเผยข้อมูลส่วนบุคคลของสมาชิกต่อผู้อื่น
                                        เว้นแต่ในกรณีที่ได้รับอนุญาตจากท่านและในกรณีพิเศษ ดังนี้
                                        <br>
                                        <br>
                                        <ol class="list-inside flex flex-col gap-4 ml-5">
                                            <li><span class="font-LineBD">1.5.1.</span> ในบางกรณี
                                                ท่านอาจได้รับเสนอโอกาสเพื่อรับข้อมูล หรือ ข่าวสารพิเศษจากผู้สนับสนุน
                                                ร้านหญ้าเทียมโกรวกลาส(Growgrass) หรือ ร้านค้าในเครือ
                                                เมื่อท่านตกลงยินยอมรับข้อมูลดังกล่าว ชื่อและ email address
                                                ของท่านจะถูกเปิดเผย</li>
                                            <li><span class="font-LineBD">1.5.2.</span> ในบางกรณี
                                                ทางร้านหญ้าเทียมโกรวกลาส(Growgrass)อาจเปิดเผยข้อมูลเป็นกรณีพิเศษ
                                                เมื่อทางโกรวกลาส(Growgrass)
                                                พิจารณาเห็นว่าการเปิดเผยข้อมูลนั้น
                                                จะมีผลต่อการดำเนินการด้านกฎหมายกับผู้ที่ละเมิดเงื่อนไขการให้บริการของ
                                                ร้านหญ้าเทียมโกรวกลาส(Growgrass) หรือ เป็นต้นเหตุแห่งความกระทบกระเทือน
                                                หรือ ความเสียหายใดๆ ต่อสมาชิกท่านอื่นๆและทางร้าน จากการแทรกแซง
                                                หรือละเมิดสิทธิ์และสมบัติใดๆ
                                                <br>
                                                <br>
                                                ไม่ว่าด้วยเจตนา หรือ ไม่ก็ตามนอกจากนี้ร้านหญ้าเทียมโกรวกลาส(Growgrass)
                                                สามารถเปิดเผยข้อมูลหากได้รับการร้องขอจากทางราชการ
                                                ภายใต้อำนาจของกฎหมายที่เกี่ยวข้อง หรือ ด้วยวัตถุประสงค์อื่นๆ
                                                ที่ทางร้านหญ้าเทียมโกรวกลาส(Growgrass)
                                                พิจารณาแล้วเห็นว่ามีความจำเป็นต่อการรักษาชื่อเสียงของทางร้าน
                                                ตลอดจนการปรับปรุงพัฒนาร้านและบริการของร้านหญ้าเทียมโกรวกลาส(Growgrass)
                                            </li>
                                        </ol>
                                    </div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.6. ทางเลือกของสมาชิกในการเก็บ, การใช้
                                        และการเผยแพร่ข้อมูล</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        ทางสมาชิกระบุความต้องการที่จะรับทราบข้อมูลกิจกรรม และข่าวสารของทางร้าน
                                        เราจะแจ้งข้อมูลต่างๆ ไปยังท่านทางจดหมายอิเล็คทรอนิกส์เกี่ยวกับข้อมูลต่างๆ
                                        หากสมาชิกท่านใดไม่ต้องการรับทราบข้อมูลข่าวสารใด ๆ จากทาง ไฮเพียวริฟาย
                                        กรุณาอย่าติ๊กถูกในขั้นตอนการสมัครสมาชิกหมวดข้อมูลส่วนตัวของคุณ เราอาจถามซ้ำจาก
                                        E-mail address ของท่าน อีกครั้งเพื่อเสนอสิทธิประโยชน์ต่างๆ เช่น
                                        คูปองส่วนลดการซื้อสินค้า
                                        <br>
                                        <br>
                                        ท่านจึงอาจได้รับจดหมายอิเล็คทรอนิกส์ที่เกี่ยวข้องกับการส่งเสริมการขายอีกครั้ง
                                        นอกจากนี้ ท่านสมาชิกยังมีสิทธิ์ปรับปรุง แก้ไขเปลี่ยนแปลง Cookies ได้ด้วยตัวท่านเอง
                                        โดยเปลี่ยนแปลงที่บราวเซอร์ในหมวด browser preferences ให้ตรงกับความต้องการของท่าน
                                        ท่านมีสิทธิ์เลือกรับ Cookies ทั้งหมด หรือไม่รับเลยก็ได้
                                        ในกรณีที่ท่านปฏิเสธไม่ต้องการรับ Cookies ทั้งหมด
                                        ท่านอาจไม่สามารถใช้บริการบางอย่างที่จำเป็นต้องมีการลงทะเบียนเหล่านั้น
                                        ทาง growgrassth@gmail.com ไม่มีนโยบายซื้อขายหรือให้เช่าข้อมูลของสมาชิกต่อบุคคลอื่น ๆ
                                        เช่น บริษัทประกัน, บริษัทขายตรง, บริษัททำเครือข่ายทุกประเภท(mlm) ฯลฯ
                                    </div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.7. การแก้ไขเปลี่ยนแปลง และลบข้อมูล</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        สมาชิกสามารถแก้ไข ปรับปรุง และเปลี่ยนแปลงข้อมูลต่างๆ ได้ด้วยตัวเอง
                                        โดยเข้าไปแก้ไขข้อมูลเหล่านี้ด้วย UsernamePassword
                                        ซึ่งท่านสามารถแก้ไขได้ทุกเวลาเมื่อท่านต้องการ
                                        <br>
                                        <br>
                                        หากท่านจำไม่ได้หรือลืม Login name และ Password
                                        ให้ท่านไปที่หน้าหลักหรือหน้าสมัครสมาชิก แล้ว Click ที่ “ลืมรหัสผ่าน”
                                        แล้วโปรแกรมจะนำท่านไปสู่หน้า ลืมรหัสผ่าน หลังจากนั้นเพียงแค่กรอก E-mail address
                                        ที่ใช้ในลงทะเบียนครั้งแรก โปรแกรมจะส่ง Login name และ Password ไปยัง E-mail address
                                        ที่ท่านใช้สมัครโดยอัตโนมัติ
                                    </div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.8. ข้อควรระวังเรื่องข้อมูลสูญหาย
                                        ถูกใช้ในทางที่ผิดและการเปลี่ยนแปลงข้อมูลของสมาชิก</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        สมาชิกต้องมีรหัสผ่านเพื่อเข้าสู่ข้อมูลส่วนตัวของท่าน
                                        สมาชิกจึงเป็นผู้เดียวที่สามารถเข้าถึงข้อมูลส่วนตัวเหล่านั้นได้ ท่านอาจแก้ไข ปรับปรุง
                                        เปลี่ยนแปลงข้อมูลเหล่านั้นได้โดยการใช้ Login name และ Password ของสมาชิกเอง ทาง
                                        ไฮเพียวริฟาย ขอแนะนำให้สมาชิกเก็บข้อมูลที่เกี่ยวข้องกับ Login name และ Password
                                        ไว้เป็นความลับ ทาง growgrassth@gmail.com จะไม่มีการถาม Password ของท่านซ้ำ
                                        ไม่ว่าจะเป็นการโทรศัพท์สอบถาม หรือส่ง E-mail ไปถาม
                                        หากสมาชิกใช้คอมพิวเตอร์ร่วมกับผู้อื่นโปรด Log out
                                        <br>
                                        <br>
                                        ทุกครั้งเมื่อท่านไม่ต้องการใช้บริการของเรา
                                        หรือปิดบราวเซอร์เมื่อเสร็จสิ้นการทำงานแล้ว
                                        เพื่อเป็นการป้องกันไม่ให้ผู้อื่นเข้ามาใช้ข้อมูลของท่าน
                                        เป็นที่เข้าใจกันโดยทั่วไปว่าการส่งข้อมูลผ่านทาง Internet
                                        นั้นไม่มีการรับรองความปลอดภัย 100 % ไม่ว่าในกรณีใดๆ ทั้งสิ้น
                                        ด้วยเหตุผลดังกล่าวข้างต้น ร้านหญ้าเทียมโกรวกลาส(Growgrass)
                                        จึงไม่สามารถรับรองความปลอดภัยในการส่งข้อมูลใดๆ ผ่านทาง Internet ทั้งสิ้น
                                    </div>
                                </li>
                                <UDivider />
                                <li>
                                    <span class="font-LineBD">1.9. เรื่องอื่นๆ ที่สมาชิกควรทราบ</span>
                                    <div class="indent-4">เราจะเก็บรวบรวมข้อมูลชื่อ นามสกุล ที่อยู่ อีเมล์ วันเดือน ปี เกิด
                                        โปรด ระมัดระวังการเปิดเผยข้อมูลส่วนตัวในขณะที่สมาชิก Online อยู่ เช่นในกรณีของการใช้
                                        Message Board, การ Chat และ E-mail
                                        เนื่องจากข้อมูลเหล่านี้อาจถูกเก็บและใช้โดยผู้อื่นได้ ดังนั้น
                                        ท่านต้องเก็บรักษาข้อมูลส่วนตัวและ password ของท่านไว้เป็นความลับ
                                    </div>
                                </li>
                            </ol>
                        </div>
                    </template>
                    <template #partTwo>
                        <div class="mx-3 mb-4 flex flex-col gap-3">
                            <ol class="list-disc list-inside flex flex-col gap-3">
                                <li>สิทธิ์ขอถอนความยินยอม</li>
                                <li>สิทธิ์ขอเข้าถึงข้อมูล</li>
                                <li>สิทธิ์ขอคัดค้าน</li>
                                <li>สิทธื์ขอให้ลบหรือทำลายข้อมูล</li>
                                <li>สิทธิ์ขอให้ระงับการใช้ข้อมูล</li>
                                <li>ขอให้แก้ไขข้อมูล</li>
                            </ol>
                        </div>
                    </template>
                    <template #partThree>
                        <div class="mx-3 mb-4 flex flex-col gap-3">
                            <p class="indent-3 ">
                                <span class="font-LineBD">เราจะไม่ใช้ข้อมูลส่วนตัวของคุณ</span>
                                เพื่อวัตถุประสงค์ใดที่เป็นการกระทบกระเทือนหรือสร้างความเดือดร้อนต่อความเป็นส่วนตัวของคุณนอกจากให้บริการหรือเท่าที่กฎหมายกำหนดเราเคารพและคำนึงถึงความเป็นส่วนตัวของลูกค้าของเราอย่างสูงสุดสิ่งที่สำคัญที่สุดคือความสัมพันธ์ระหว่างคุณและเราเราต้องการให้คุณสบายใจและมั่นใจใช้ผลิตภัณฑ์และบริการของเราและเชื่อถือความปลอดภัยของข้อมูลส่วนตัวและแบบแสดงรายการที่คุณกรอกไว้ให้เรา
                            </p>
                            <UDivider />
                            <p class="indent-3 ">
                                <span class="font-LineBD">คุณมีหน้าที่</span>
                                ปกป้องข้อมูลบนอุปกรณ์ของคุณเช่นกันโดยใช้โปรแกรมป้องกันไวรัสการอัพเดทซอฟท์แวร์เปลี่ยนรหัสผ่านและไม่ให้บุคคลที่สามเข้าถึงอุปกรณ์ของคุณไม่ว่าทางใด
                            </p>
                        </div>
                    </template>
                    <template #partFour>
                        <div class="mx-3 flex flex-col gap-3">
                            <p class="indent-3 ">
                                <span class="font-LineBD">เพราะข้อมูลของคุณเป็นสิ่งที่มีค่ามาก</span>
                                ที่สุดเราให้ความสำคัญกับความเชื่อมั่นของคุณเป็นอันดับหนึ่งสำหรับเราเราละลึกอยู่เสมอว่าคุณต้องการความปลอดภัยสูงสุดในการใช้บริการและรักษาความลับของข้อมูลส่วนตัวเราจึงดำเนินการอย่างเข้มงวดเพื่อรักษาความปลอดภัยและป้องกันการนำข้อมูลของคุณโดยไม่ได้รับอนุญาตด้วยมาตรฐานขั้นสูง
                            </p>

                        </div>
                    </template>
                </UAccordion>
                <UDivider class="my-5" />
            </div>
            <!-- modal footer -->
            <div class="dark:text-gray-300 ">
                <p class="indent-0 mt-2">
                <p class="font-LineBD leading-6 ">
                    <span class="text-red-500">*</span>กรุณาอ่านเงื่อนไขรับประกันให้ครบถ้วน
                </p>
                ในกรณีที่ท่านคลิกปุ่มลงทะเบียนทางgrowgrass จะถือว่าท่านได้อ่านทำความเข้าใจ
                และยอมรับเงื่อนไขทั้งหมดกล่าวมาข้างต้นแล้ว
                </p>
            </div>
            <div class="flex w-full justify-center mt-3">
                <NuxtImg height="150px" width="150px"
                    src="https://stickershop.line-scdn.net/stickershop/v1/sticker/139737216/android/sticker.png;compress=true" />
            </div>
        </UCard>
    </UModal>
    <!-- เงื่อนไขและข้อกำหนดการรับประกัน -->
    <UModal v-model="termsModal" prevent-close>
        <UCard style="height: 80dvh" class="overflow-y-scroll" :ui="{
            ring: '',
            divide: 'divide-y divide-gray-100 dark:divide-gray-800',
        }">
            <template #header>
                <div class="flex items-center justify-between">
                    <h3 class="text-base font-LineBD leading-6 text-gray-900 dark:text-white">
                        {{ PrivacyAndTerms.terms.title }}
                    </h3>
                    <UButton color="gray" variant="ghost" icon="i-heroicons-x-mark-20-solid" class="-my-1"
                        @click="termsModal = false" />
                </div>
            </template>
            <!-- modal content -->
            <div class="dark:text-gray-200">
                <p class="indent-0 mt-2">
                <p class="font-LineBD text-2xl">ขอขอบพระคุณเป็นอย่างยิ่ง!</p>
                ที่ท่านได้เลือกสินค้าของทางGrowgrass และ
                ขอเรียนให้ทราบถึงหลักเกณฑ์การรับประกันดังนี้
                </p>
            </div>
            <UDivider class="my-5" />
            <div class="">
                <UAccordion color="primary" variant="solid" size="lg" :items="[
                    {
                        label: '1. หลักเกณฑ์การรับประกัน',
                        slot: 'partOne',
                    },
                    {
                        label: '2. เงื่อนไขการรับประกัน',
                        slot: 'partTwo',
                    },
                    {
                        label: '3. เงื่อนไขที่ไม่ได้รับประกัน',
                        slot: 'partThree',
                    },
                    {
                        label: '4. การดูแลบำรุงรักษาเพิ่มเติม',
                        slot: 'partFour',
                    },
                ]">
                    <template #partOne>
                        <div class="mx-3 mb-4">
                            <ol class="list-disc list-inside flex flex-col gap-3">
                                <li>
                                    ร้านหญ้าเทียมโกรวกลาส(Growgrass) ขอรับประกันคุณภาพหญ้าเทียม
                                    ต่อผู้ซื้อที่ได้ลงทะเบียนหรือประกันไว้กับทางร้านอย่างถูกต้องตามระเบียบเท่านั้น
                                    โดยเริ่มนับจากวันที่สินค้าได้มีการซื้อขาย หรือ ติดตั้ง
                                    ตามใบเสร็จ
                                    และส่งมอบระหว่างผู้ซื้อกับทางร้านค้าหรือตัวแทนจำหน่ายเป็นวันเริ่มต้นรับประกัน
                                </li>

                                <li>
                                    กรุณากรอกข้อความให้ชัดเจนและส่งภายใน 7 วัน
                                    หลังจากวันที่ซื้อหากเกินกำหนดดังกล่าว
                                    ทางร้านจะถือว่าท่านสละสิทธิ์
                                </li>

                                <li>
                                    การรับประกันนี้ จะรับประกันเฉพาะผลิตภัณฑ์ที่GrowGrass
                                    เป็นผู้ผลิตหรือนำเข้ามาจำหน่าย เมื่อมีการขัดข้องเสียหายใดๆ
                                    อันเนื่องมาจากความบกพร่องของโรงงานหรือชำรุดบกพร่องในระบบการทำงาน
                                    การใช้งานตามปกติผู้ซื้อสามารถขอรับบริการตรวจซ่อมหรือเปลี่ยนสินค้าได้โดยให้เป็นไปตามเงื่อนไขการรับรับประกัน
                                </li>

                                <li>
                                    ผู้ซื้อไม่ต้องเสียค่าใช้จ่ายใดๆ
                                    โดยมีเงื่อนไขว่าผู้ซื้อต้องมอบชิ้นส่วนที่ชำรุดบกพร่องของผลิตภัณฑ์นั้นตามที่ปรากฎจริงคืนแก่เจ้าหน้าที่ของบริษัทฯ
                                    เท่านั้น
                                </li>

                                <li>
                                    การรับประกันไม่รวมถึงค่าเดินทางหรือค่าพาหนะในการบริการนอกสถานที่
                                </li>

                                <li>
                                    ผู้ซื้อต้องแสดงหลักฐานการประกันแก่ทางร้านทุกครั้ง
                                    มิฉะนั้นร้านจะคิดค่าใช้จ่ายในการซ่อมแซ่ม
                                </li>
                            </ol>
                        </div>
                    </template>
                    <template #partTwo>
                        <div class="mx-3 mb-4 flex flex-col gap-3">
                            <p class="indent-3">
                                <span class="font-LineBD">
                                    ร้านหญ้าเทียมโกรวกลาส(Growgrass)
                                    รับประกันหญ้าเทียมที่ผู้ซื้อ</span>
                                นับจากวันที่จัดส่งโดยจะคลอบคลุมปัญหาที่เกิดจากข้อบกพร่องทั้งหมดในวัสดุและ
                                หรือฝีมือการผลิตรวมถึงข้อบกพร่อง
                                เช่นการซีดจางมากเกินไปการหลุดร่วงของขนหญ้ามากเกินไปและสารเคลือบรังสีอัลตราไวโอเลตสำหรับกันแสงแดด
                            </p>
                            <UDivider />
                            <p class="indent-3">
                                <span class="font-LineBD">หญ้าเทียมโกรวกลาสให้คำมั่นสัญญา</span>
                                ว่าจะให้ความสำคัญกับคุณภาพของ ผลิตภัณฑ์
                                และ ความพึงพอใจของลูกค้าเป็นอันดับแรกหากมีคุณภาพและปัญหาที่
                                คาดไม่ถึง
                                ข้อบกพร่องที่พบเมื่อหญ้าเทียมคลี่ออกหรือปัญหาด้านคุณภาพที่เกิดขึ้น
                                ระหว่างการใช้งานสนามหญ้าเทียมตามปกติ หญ้าเทียมโกรวกลาส
                                จะจัดหาวิธีแก้ปัญหาที่สมเหตุสมผลและยอมรับได้
                                รวมถึงการให้ส่วนลดพิเศษเพื่อชดเชยการสูญเสีย
                                จัดเปลี่ยนสนามหญ้าเทียม ฟรี เพื่อทดแทนหญ้าเทียมที่มีข้อบกพร่อง
                                หรือวิธีแก้ปัญหาอื่น ๆ ที่ผู้ซื้อสามารถยอมรับได้
                            </p>

                            <p>
                                โดยผู้ซื้อมีหน้าที่ต้องจัดเตรียมรูปภาพ วิดีโอ
                                หรือรายงานของบุคคลที่สามเพื่อพิสูจน์
                                ว่าปัญหาด้านคุณภาพนั้นมีอยู่จริง
                            </p>
                        </div>
                    </template>
                    <template #partThree>
                        <div class="mx-3 mb-4 flex flex-col gap-3">
                            <p class="indent-3 font-LineBD">
                                การรับประกันสินค้าจะไม่ครอบคลุมในกรณีดังต่อไปนี้
                                (อาจต้องมีค่าใช้จ่ายในการซ่อมหรือเปลี่ยนสินค้ารวมถึงกรณีที่ไม่อาจเปลี่ยนหรือซ่อมได้)
                            </p>
                            <UDivider />
                            <ol class="mx-4 list-disc list-inside flex flex-col gap-3">
                                <li>
                                    การรับประกันนี้ไม่ครอบคลุมถึงข้อบกพร่องที่เกิดจากการปรับหน้าดินที่ไม่ดี
                                    (ในกรณีที่ลูกค้าทำการปรับหน้าดินเอง) อุปกรณ์เสริมในการติดตั้ง
                                    หรือความผิดพลาดที่อยู่โดยการออกแบบที่เหมาะสม
                                </li>
                                <li>
                                    การรับประกันไม่รวมถึงข้อบกพร่องในการระบายน้ำ (น้ำขัง )
                                    ที่เกิดจากการปรับหน้าดินที่ไม่เหมาะสม
                                </li>
                                <li>ความเสียหายอันเนื่องจากสัตว์ต่างๆ</li>
                                <li>
                                    ความเสียหายโดยเจตนาของผู้ใช้งานเองและสาเหตุจากการไม่ระมัดระวังของผู้ใช้งาน
                                </li>
                                <li>
                                    กรณีเปลี่ยนสินค้าที่เสียหรือเคลมสินค้า
                                    ขอสงวนสิทธิ์ในการเปลี่ยนเป็นรุ่นเดิมเท่านั้นหากต้องการรุ่นอื่นต้องมีชำระส่วนต่างเพิ่มเติมด้วย
                                </li>
                                <li>
                                    หญ้าเทียมโกรวกลาสไม่รับประกันว่าหญ้าเทียมจะเสื่อมสภาพจากการสึกหรอตามปกติการรับประกันนี้ไม่รวมถึงข้อบกพร่องที่เกิดจากสภาพของปัจจัยที่อยู่นอกเหนือการควบคุมของร้านโกรวกลาส
                                    (เช่น อุทกภัย อัคคีภัย หรือภัยธรรมชาติอื่นๆ)
                                </li>
                                <li>
                                    ความเสียหายที่เกิดจากการจงใจทำลายละเลยการดูแลหรือการสวมใส่รองเท้าที่มีพื้นไม่เหมาะสม
                                    ก็ไม่อยู่ภายใต้การรับประกันเช่นเดียวกัน
                                </li>
                                <li>
                                    หญ้าเทียมชำรุดเพราะถูกใช้ในทางที่ผิดจุดประสงค์ที่ออกแบบไว้
                                    หญ้าเทียมถูกดัดแปลง
                                    ต่อเติมแก้ไขซ่อมแซมโดยช่างที่ไม่ใช่ตัวแทนของบริษัทฯ
                                </li>
                                <li>
                                    รอยขีดข่วน สนิม รอยฉีก ขาด
                                    ที่เกิดจากการถูกกระทบหรือถูกกดทับด้วยวัตถุต่างๆ หรือ
                                    ถูกสารเคมี และเกิดภัยธรรมชาติ
                                    หรือเก็บไว้ในที่อุณหภูมิสูงกว่ากำหนดหรือเกิดจากสภาพตามอายุการใช้งานหรือสิ่งแวดล้อมอันเป็นเรื่องปกติของสินค้าทั่วไป
                                </li>
                            </ol>
                        </div>
                    </template>
                    <template #partFour>
                        <div class="mx-3 flex flex-col gap-3">
                            <p class="indent-3 font-LineBD">
                                คำแนะนำในการบำรุงรักษาพื้นผิวหญ้าเทียมอย่างเหมาะสมตามที่ระบุไว้ด้านล่าง
                                และการดูแลบำรุงรักษาเพิ่มเติม
                                ให้พิจารณาในการละเลยหรือบำรุงรักษาพื้นผิวหญ้าเทียมอย่างเหมาะสมและให้ถือว่าเป็นส่วนหนึ่งของการรับประกันนี้
                            </p>
                            <UDivider />
                            <ol class="mx-4 list-disc list-inside flex flex-col gap-3">
                                <li>
                                    ควรกวาดทำความสะอาดย้อนขนหญ้าอย่างน้อยเดือนละครั้ง
                                    เพื่อป้องกันไม่ให้ขนหญ้าเรียบแบนได้ง่าย และ ยังตั้งสวยอยู่เสมอ
                                </li>
                                <li>
                                    หากหญ้าเทียมบางส่วนที่ต้องโดนแดดอยู่เป็นประจำ
                                    ช่วงแดดจัดๆสามารถฉีดน้ำรถหญ้าเทียมเพื่อคลายความร้อน
                                    ช่วยยืดอายุการใช้งานได้นานมากขึ้นหรือฉีดน้ำอย่างน้อยอาทิตย์ละครั้ง
                                </li>
                                <li>
                                    ไม่ว่าที่ใดและเมื่อใดก็ตามที่มีสิ่งเจือปนอยู่ให้นำออกโดยเร็วที่สุด
                                </li>
                                <li>ควรสังเกตว่าไม่ควรให้มีอาหารหรือเครื่องดื่มบนสนามหญ้า</li>
                                <li>ห้ามโดนสะเก็ดไฟ เช่น จากบุหรี่ จากการทำอาหาร</li>
                                <li>
                                    สารอินทรีย์ทั้งหมดเช่นใบดิน เมล็ดพืชเป็นต้น
                                    หากทิ้งไว้จะส่งผลให้สาหร่าย สาหร่ายมอส หรือวัชพืชเจริญเติบโต
                                    ควรกำจัด ออกทันที
                                </li>
                                <li>
                                    กรณีเลอะน้ำยาขัดรองเท้า โลชั่น หมึกปากกา เทียนไข ยางไม้
                                    สามารถเช็ดออกได้ด้วย “คลอรีน”
                                </li>
                                <li>
                                    กรณีเกิดคราบเชื้อรา คราบสกปรกจากเชื้อรา หรือเชื้อราจากน้ำค้าง
                                    สามารถใช้ “ไฮโดรเจนเปอร์ออกไซด์ 1%”เช็ดออกได้
                                </li>
                                <li>
                                    แสงแดดที่สะท้อนบนหน้าต่างหรือเหล็กอาจทำให้เกิดการรวมแสงของแดดและทำให้หญ้าเทียมละลายได้
                                    ไม่ใช่ข้อบกพร่องด้าน
                                    คุณภาพปัญหาที่เกิดจากสิ่งนี้ไม่รวมอยู่ในการรับประกันนี้สามารถติดฟิล์มกันแดดไว้ด้านนอกหน้าต่างเพื่อหลีกเลี่ยงปัญหานี้
                                </li>
                                <!-- <li></li> -->
                            </ol>
                        </div>
                    </template>
                </UAccordion>
            </div>
            <UDivider class="my-5" />
            <!-- modal footer -->
            <div class="dark:text-gray-300 ">
                <p class="indent-0 mt-2">
                <p class="font-LineBD leading-6 ">
                    <span class="text-red-500">*</span>กรุณาอ่านเงื่อนไขรับประกันให้ครบถ้วน
                </p>
                ในกรณีที่ท่านคลิกปุ่มลงทะเบียนทางgrowgrass จะถือว่าท่านได้อ่านทำความเข้าใจ
                และยอมรับเงื่อนไขทั้งหมดกล่าวมาข้างต้นแล้ว
                </p>
            </div>
            <div class="flex w-full justify-center mt-3">
                <NuxtImg height="150px" width="150px"
                    src="https://i.pinimg.com/originals/1e/60/06/1e600659797f3934a501062d92e58af8.png" />
            </div>
        </UCard>
    </UModal>
</template>

<style scoped></style>
