const MainPageAds1 = [
  {
    lineLink: "",
    textstyle: "text-slate-900",
    img: "/ai-img/aidall11.png",
    title: "ยินดีต้อนรับสู่ growgrass",
    titlesize: "text-4xl",
    description: "บริการจัดสวนและติดตั้งหญ้าเทียม",
    btndetail: {
      id: 1,
      title: "ยินดีต้อนรับ",
      detail:
        "ยินดีต้อนรับสู่ growgrass – ที่นี่เรามอบโซลูชั่นด้านหญ้าเทียมที่มีคุณภาพและความสวยงามให้กับทุกพื้นที่ของคุณ เราเชื่อมั่นว่าสวนที่สวยงามสามารถสร้างความสุขและความสงบ มาเริ่มต้นสร้างสวนในฝันกับเราเลยวันนี้!",
    },
  },
  {
    lineLink: "https://shop.line.me/@growgrass/collection/185535",
    textstyle: "text-slate-900",
    img: "https://img2.pic.in.th/pic/Z06_8035_23_11zon.webp",
    title: "1cmAA",
    titlesize: "text-5xl",
    description: "ตารางเมตรละ 119.-",
    btndetail: {
      id: 2,
      title: "หญ้าเทียมปูพื้นรุ่นขนสั้น 1cmAA ใบยาว 1ซม. (เกรดปูพื้น)",
      detail:
        "ความสูงใบหญ้า หญ้าเทียม 1 ซม. ผลิตจากวัสดุ PE มั่นใจเรื่องความปลอดภัยจากสารพิษหรือโลหะหนัก ความหนาแน่น 300s/m 30ฝีเข็ม พื้นหลังสีดำเสริมการเคลือบเงา สามารถปูได้ทั้งกลางแจ้งและในร่ม เหมาะสำหรับปูพื้นให้สัตว์เลี้ยง หรือเด็กเล็ก มีจุดเด่นที่การทำความสะอาดง่าย หญ้าเรียงตัวเป็นระเบียบสวยงาม หญ้าเทียมปูพื้น รุ่น 1cmAA คือหญ้าเทียมที่ไม่อมฝุ่นและใช้งานง่าย จะใช้ปูโต๊ะขายของหรือพื้นตามงานอีเวนท์ก็ได้ค่ะ",
    },
  },
  {
    lineLink: "https://shop.line.me/@growgrass/collection/185536",
    textstyle: "text-slate-900",
    img: "https://img5.pic.in.th/file/secure-sv1/Z06_8005_15_11zon.webp",
    title: "2cmAA",
    titlesize: "text-5xl",
    description: "ตารางเมตรละ 169.-",
    btndetail: {
      id: 3,
      title: "หญ้าเทียมปูพื้นรุ่นกลาง 2cmAA ใบยาว 2ซม. (เกรดปูพื้น)",
      detail:
        "ความสูงใบหญ้า หญ้าเทียม 2 ซม. ผลิตจากวัสดุ PE มั่นใจเรื่องความปลอดภัยจากสารพิษหรือโลหะหนัก ความหนาแน่น 150s/m 15ฝีเข็ม พื้นหลังสีดำด้าน ประกอบด้วยใบหญ้าใบเล็ก 2สี สามารถปูได้ทั้งกลางแจ้งและในร่ม มีจุดเด่นที่การทำความสะอาดง่าย ราคาไม่แพงแต่การเรียงตัวหญ้าไม่ค่อยเป็นระเบียบ หญ้าเทียมปูพื้น รุ่น 2cmAA ด้วยความที่ใบหญ้ามีความสูงมากกว่ารุ่น 1cm แบบเห็นได้ชัด ทำให้มีความสมจริงเมื่อเทียบกันแล้วแบบค่อนข้างชัดเจน ใครกำลังต้องการหญ้าเทียมระดับกลาง ที่มีความใกล้เคียงกับหญ้าจริง แต่ราคาไม่แพงต้องรุ่นนี้เลยค่ะ",
    },
  },
  {
    lineLink: "https://shop.line.me/@growgrass/collection/185537",
    textstyle: "text-slate-900",
    img: "https://img2.pic.in.th/pic/Z06_7991_10_11zon.webp",
    title: "3cmPM",
    titlesize: "text-5xl",
    description: "ตารางเมตรละ 319.-",
    btndetail: {
      id: 4,
      title: "หญ้าเทียมปูพื้นขนยาวมาก 3cmPM ใบยาว 3ซม. (เกรดปูสวน)",
      detail:
        "ความสูงใบหญ้า หญ้าเทียม 3 ซม. ผลิตจากวัสดุ PE มั่นใจเรื่องความปลอดภัยจากสารพิษหรือโลหะหนัก ความหนาแน่น 180s/m 18ฝีเข็ม พื้นหลังเคลือบเงาเสริมตาข่าย ใบหญ้า 2สี ประกอบด้วยใบปกติและใบเล็ก การเรียงตัวใบหญ้าเป็นระเบียบสวยงาม จุดเด่นฝีเข็มเยอะ ใบหญ้าตั้งตรงมันคงไม่ล้มง่ายที่สุด รู้สึกเหมือนหญ้าเต็มพื้นผิว จุดด้อยสัมผัสค่อนข้างออกไปแน่น เนื่องจากมีฝีเข็มเยอะ ถ้าคนชอบนุ่มๆจะไม่เหมาะ หญ้าเทียมปูพื้น รุ่น 3cmPM เป็นรุ่นใบหญ้ายาวเกรดพรีเมียม เคลือบสารกัน UV มีรับประกันมากถึง 3ปี ด้วยความที่มีฝีเข็มมาก",
    },
  },
  {
    lineLink: "https://shop.line.me/@growgrass/collection/185537",
    textstyle: "text-slate-900",
    img: "https://img5.pic.in.th/file/secure-sv1/Z06_7979_6_11zon.webp",
    title: "3.5cmPM",
    titlesize: "text-5xl",
    description: "ตารางเมตรละ 299.-",
    btndetail: {
      id: 5,
      title: "หญ้าเทียมปูพื้นขนยาว 3.5cm ใบยาว 3.5ซม. (เกรดพรีเมียม)",
      detail:
        "ความสูงใบหญ้า หญ้าเทียม 3.5 ซม. ผลิตจากวัสดุ PE มั่นใจเรื่องความปลอดภัยจากสารพิษหรือโลหะหนัก ความหนาแน่น 150s/m 16ฝีเข็ม พื้นหลังเสริมตาข่าย หนา3ชั้น ใบหญ้า 3สี ประกอบด้วยใบปกติ ใบเล็ก และแบบฝอย เป็นรุ่นเดียวที่มีใบหญ้าสีแห้ง(คล้ายหญ้าตาย) ในตัว การเรียงตัวใบหญ้าเป็นระเบียบสวยงามค่อนข้างตั้งไม่ล้มง่าย จุดเด่นนุ่มที่สุดในทุกรุ่น หญ้าเทียมปูพื้น รุ่น 3.5cm เป็นรุ่นใบหญ้ายาวมากเกรดพรีเมียม เคลือบสารกัน UV มีรับประกันมากถึง 3ปี เหมาะสำหรับปูสวนในโครงการหรือบ้านเดี่ยว",
    },
  },
];
const MainPageAds2 = [
  {
    textstyle: "text-white",
    titlesize: "",
    img: "/ai-img/aidall4.png",
    title: "งานติดตั้งหญ้าเทียม",
    description: "เริ่มต้น 200.-",
  },
  {
    textstyle: "text-white",
    titlesize: "",
    img: "/img/dalle2.png",
    title: "บริการวัดพื้นที่",
    description: "ค่าเดินทางเริ่มต้น 30.-",
  },
];

const modalData = [
  {
    item1: {
      id: 1,
      card1: {
        title: "card 1 id 1",
        detail: "card 1 detail 1",
      },
      card2: {
        id: 2,
        title: "card 2 id card 2",
        detail: "card 2 detail card 2",
      },
      card3: {
        id: 3,
        title: "card 3 id card 3",
        detail: "card 3 detail card 3",
      },
    },
    item2: {
      id: 2,
      card1: {
        title: "card 1 id card 1",
        detail: "card 1 detail card 1",
      },
      card2: {
        id: 2,
        title: "card 2 id card 2",
        detail: "card 2 detail card 2",
      },
      card3: {
        id: 3,
        title: "card 3 id card 3",
        detail: "card 3 detail card 3",
      },
    },
  },
];

export { MainPageAds1, MainPageAds2, modalData };
